class User {
  final String id;
  final String name;
  final bool isAdmin;
  final bool isAccepted;
  final String number;

  User({
    required this.id,
    required this.name,
    required this.isAdmin,
    required this.number,
    required this.isAccepted,
  });

  factory User.formFirebase(json) {
    return User(
      id: json['id'],
      name: json['name'],
      isAdmin: json['isAdmin'],
      isAccepted: json['isAccepted'],
      number: json['number'],
    );
  }

  Map<String, dynamic> toFirebase() {
    return {
      'id': id,
      'name': name,
      'isAdmin': isAdmin,
      'number': number,
      'isAccepted': isAccepted,
    };
  }
}

List<String> Students = [
  'ابوبكر عادل محمد احمد',
  'احمد مصطفى محمد يحيى',
  'اسامة عادل عبدالرؤوف احمد',
  'اسامة محفوظ قاسم محمد',
  'المنتصر بالله احمد فقير',
  'ایمن محمد هائل عبد اللطيف',
  'إيناس عادل عبدالجليل سيف',
  'جواد عبدالله عبده عبدالله',
  'حذيفة خالد سفيان علي',
  'حلا محمد محمد حيدر',
  'حماس محمد سعید ناجی',
  'حنان عمر سعید محمد',
  'حنين حلمي محمد ردمان ',
  'خالد ممدوح احمد مفلح',
  'داليا وديع يحيى عبده ',
  'رؤى نبيل غالب محمد',
  'رغد معاذ عبدالكريم يحيى',
  'رفيدة مبارك محمد عبده',
  'رنا فؤاد صالح عبدالماجد',
  'روان خالد محمد اسماعیل',
  'ريان مصطفی محمد عبدالرحمن',
  'سمية سعيد غالب احمد',
  'شروق حمود زائد عبدالله',
  'شعيب عبد الباري سعد احمد',
  'صقر محمد عبدالحميد',
  'عبدالله عبدالرحمن محمد',
  'عماد عبدالمجيد على قائد',
  'محمد امین سيف علي',
  'محمد زكريا محمد علي',
  'محمد عبدالعزيز الحياني',
  'محمد عبدالملك احمد محمد',
  'مروة عبدالغفار عبدالدائم',
  'ملاك احمد سعید فرحان',
  'ندى نجيب حمود غالب',
  'نسيبة مونس محمد',
  'هلال احمد امین حسن',
  'وسام احمد قائد',
  'ولاء عبدالقوي سعيد عبدالله',
  'اسامة امین ردمان خالد',
  'اسراء محمد غالب سيف',
  'امیمة نجیب عبدالرقيب',
  'بسمة غالب محمد صالح',
  'عماد سعید احمد عبده',
  'لبيب فيصل محمد محمد',
  'محمد علي محمد زيد',
  'محمود انیس امین احمد',
  'هالة فؤاد علي محمد',
  'يوسف يعقوب ناجي قائد',
];
