class User {
  final String id;
  final String name;
  final bool isAdmin;
  final bool isAccepted;
  final String number;

  User({
    required this.id,
    required this.name,
    required this.isAdmin,
    required this.number,
    required this.isAccepted,
  });

  factory User.formFirebase(json) {
    return User(
      id: json['id'],
      name: json['name'],
      isAdmin: json['isAdmin'],
      isAccepted: json['isAccepted'],
      number: json['number'],
    );
  }

  Map<String, dynamic> toFirebase() {
    return {
      'id': id,
      'name': name,
      'isAdmin': isAdmin,
      'number': number,
      'isAccepted': isAccepted,
    };
  }
}

List<String> Students = [
  'ابوبكر عادل محمد احمد',
  'احمد مصطفى محمد يحيى',
  'اسامه عادل عبدالرؤوف احمد',
  'اسامه محفوظ قاسم محمد',
  'المنتصر بالله احمد فقير حلبي',
  'ایمن محمد هائل عبد اللطيف',
  'ابناس عادل عبدالجليل سيف',
  'جواد عبدالله عبده عبدالله',
  'حذيفة خالد سفيان علي',
  'حلا محمد محمد حيدر ',
  'حماس محمد سعید ناجی',
  'حنان عمر سعید محمد',
  'حنين حلمي محمد ردمان ',
  'خالد ممدوح احمد مفلح',
  'داليا وديع يحيى عبده ',
  'رؤى نبيل غالب محمد ',
  'رغد معاذ عبدالكريم يحيى',
  'رفيده مبارك محمد عبده',
  'رنا فؤاد صالح عبدالماجد',
  'روان خالد محمد اسماعیل',
  'ريان مصطفی محمد عبدالرحمن',
  'سمية سعيد غالب احمد',
  'شروق حمود زائد عبدالله',
  'شعيب عبد الباري سعد احمد',
  'صقر محمد عبدالحميد عبدالعزيز',
  'عبدالله عبدالرحمن محمد فرحان',
  'عماد عبدالمجيد على قائد',
  'محمد امین سيف علي',
  'محمد زكريا محمد علي',
  'محمد عبدالعزيز محمد الحياني',
  'محمد عبدالملك احمد محمد',
  'مروه عبدالغفار عبدالدائم عبدالقادر',
  'ملاك احمد سعید فرحان',
  'ندى نجيب حمود غالب',
  'نسيبة مونس محمد عبدالواحد ',
  'هلال احمد امین حسن',
  'وسام احمد قائد عبدالغني',
  'ولاء عبد القوي سعيد عبدالله',
  'اسامة امین ردمان خالد',
  'اسراء محمد غالب سيف',
  'امیمة نجیب عبدالرقيب عبدالرحمن',
  'بسمه غالب محمد صالح',
  'عماد سعید احمد عبده',
  'لبيب فيصل محمد محمد',
  'محمد علي محمد زيد',
  'محمود انیس امین احمد',
  'هالة فؤاد علي محمد',
  'يوسف يعقوب ناجي قائد',
];
